电脑/python/flask/flask-socketio.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-03-01 二 09:16 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>flask-socketio</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">flask-socketio</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 简介</a></li>
<li><a href="#orgheadline5">2. 第一个例子</a>
<ul>
<li><a href="#orgheadline2">2.1. 事件</a></li>
<li><a href="#orgheadline3">2.2. namespace</a></li>
<li><a href="#orgheadline4">2.3. emit函数</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div class="outline-2">
<h2 id="orgheadline1">简介</h2>
<div class="outline-text-2" id="text-1">
<p>
推荐使用 <code>flask-socketio</code> 这个模块:
</p>

<pre>
pip install flask-socketio
</pre>

<p>
其入门tutorial在 <a href="http://blog.miguelgrinberg.com/post/easy-websockets-with-flask-and-gevent">这里</a> ，其github地址在 <a href="https://github.com/miguelgrinberg/Flask-SocketIO">这里</a> ，其官方文档地址在 <a href="https://github.com/miguelgrinberg/Flask-SocketIO">这里</a> 。
</p>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline5">第一个例子</h2>
<div class="outline-text-2" id="text-2">
<p>
test.py
</p>

<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">flask</span> <span class="kn">import</span> <span class="n">Flask</span><span class="p">,</span> <span class="n">render_template</span>
<span class="kn">from</span> <span class="nn">flask.ext.socketio</span> <span class="kn">import</span> <span class="n">SocketIO</span><span class="p">,</span> <span class="n">emit</span>

<span class="n">app</span> <span class="o">=</span> <span class="n">Flask</span><span class="p">(</span><span class="n">__name__</span><span class="p">)</span>
<span class="n">app</span><span class="o">.</span><span class="n">config</span><span class="p">[</span><span class="s1">&#39;SECRET_KEY&#39;</span><span class="p">]</span> <span class="o">=</span> <span class="s1">&#39;secret!&#39;</span>
<span class="n">socketio</span> <span class="o">=</span> <span class="n">SocketIO</span><span class="p">(</span><span class="n">app</span><span class="p">)</span>

<span class="nd">@app.route</span><span class="p">(</span><span class="s1">&#39;/&#39;</span><span class="p">)</span>
<span class="k">def</span> <span class="nf">index</span><span class="p">():</span>
    <span class="k">return</span> <span class="n">render_template</span><span class="p">(</span><span class="s1">&#39;index.html&#39;</span><span class="p">)</span>

<span class="nd">@socketio.on</span><span class="p">(</span><span class="s1">&#39;my event&#39;</span><span class="p">,</span> <span class="n">namespace</span><span class="o">=</span><span class="s1">&#39;/test&#39;</span><span class="p">)</span>
<span class="k">def</span> <span class="nf">test_message</span><span class="p">(</span><span class="n">message</span><span class="p">):</span>
    <span class="n">emit</span><span class="p">(</span><span class="s1">&#39;my response&#39;</span><span class="p">,</span> <span class="p">{</span><span class="s1">&#39;data&#39;</span><span class="p">:</span> <span class="n">message</span><span class="p">[</span><span class="s1">&#39;data&#39;</span><span class="p">]})</span>

<span class="nd">@socketio.on</span><span class="p">(</span><span class="s1">&#39;my broadcast event&#39;</span><span class="p">,</span> <span class="n">namespace</span><span class="o">=</span><span class="s1">&#39;/test&#39;</span><span class="p">)</span>
<span class="k">def</span> <span class="nf">test_message</span><span class="p">(</span><span class="n">message</span><span class="p">):</span>
    <span class="n">emit</span><span class="p">(</span><span class="s1">&#39;my response&#39;</span><span class="p">,</span> <span class="p">{</span><span class="s1">&#39;data&#39;</span><span class="p">:</span> <span class="n">message</span><span class="p">[</span><span class="s1">&#39;data&#39;</span><span class="p">]},</span> <span class="n">broadcast</span><span class="o">=</span><span class="bp">True</span><span class="p">)</span>

<span class="nd">@socketio.on</span><span class="p">(</span><span class="s1">&#39;connect&#39;</span><span class="p">,</span> <span class="n">namespace</span><span class="o">=</span><span class="s1">&#39;/test&#39;</span><span class="p">)</span>
<span class="k">def</span> <span class="nf">test_connect</span><span class="p">():</span>
    <span class="n">emit</span><span class="p">(</span><span class="s1">&#39;my response&#39;</span><span class="p">,</span> <span class="p">{</span><span class="s1">&#39;data&#39;</span><span class="p">:</span> <span class="s1">&#39;Connected&#39;</span><span class="p">})</span>

<span class="nd">@socketio.on</span><span class="p">(</span><span class="s1">&#39;disconnect&#39;</span><span class="p">,</span> <span class="n">namespace</span><span class="o">=</span><span class="s1">&#39;/test&#39;</span><span class="p">)</span>
<span class="k">def</span> <span class="nf">test_disconnect</span><span class="p">():</span>
    <span class="k">print</span><span class="p">(</span><span class="s1">&#39;Client disconnected&#39;</span><span class="p">)</span>

<span class="k">if</span> <span class="n">__name__</span> <span class="o">==</span> <span class="s1">&#39;__main__&#39;</span><span class="p">:</span>
    <span class="n">socketio</span><span class="o">.</span><span class="n">run</span><span class="p">(</span><span class="n">app</span><span class="p">,</span><span class="n">debug</span><span class="o">=</span><span class="bp">True</span><span class="p">)</span>
</pre></div>

<p>
然后在templates文件夹下建立的 <code>index.html</code> :
</p>
<div class="highlight"><pre><span></span><span class="cp">&lt;!DOCTYPE HTML&gt;</span>
<span class="p">&lt;</span><span class="nt">html</span><span class="p">&gt;</span>
<span class="p">&lt;</span><span class="nt">head</span><span class="p">&gt;</span>
    <span class="p">&lt;</span><span class="nt">title</span><span class="p">&gt;</span>Flask-SocketIO Test<span class="p">&lt;/</span><span class="nt">title</span><span class="p">&gt;</span>
    <span class="p">&lt;</span><span class="nt">script</span> <span class="na">type</span><span class="o">=</span><span class="s">&quot;text/javascript&quot;</span> <span class="na">src</span><span class="o">=</span><span class="s">&quot;//code.jquery.com/jquery-1.4.2.min.js&quot;</span><span class="p">&gt;&lt;/</span><span class="nt">script</span><span class="p">&gt;</span>
    <span class="p">&lt;</span><span class="nt">script</span> <span class="na">type</span><span class="o">=</span><span class="s">&quot;text/javascript&quot;</span> <span class="na">src</span><span class="o">=</span><span class="s">&quot;//cdnjs.cloudflare.com/ajax/libs/socket.io/1.3.5/socket.io.min.js&quot;</span><span class="p">&gt;&lt;/</span><span class="nt">script</span><span class="p">&gt;</span>

<span class="p">&lt;</span><span class="nt">script</span><span class="p">&gt;</span>
<span class="nx">$</span><span class="p">(</span><span class="nb">document</span><span class="p">).</span><span class="nx">ready</span><span class="p">(</span><span class="kd">function</span><span class="p">(){</span>
    <span class="kd">var</span> <span class="nx">socket</span> <span class="o">=</span> <span class="nx">io</span><span class="p">.</span><span class="nx">connect</span><span class="p">(</span><span class="s1">&#39;http://&#39;</span> <span class="o">+</span> <span class="nb">document</span><span class="p">.</span><span class="nx">domain</span> <span class="o">+</span> <span class="s1">&#39;:&#39;</span> <span class="o">+</span> <span class="nx">location</span><span class="p">.</span><span class="nx">port</span> <span class="o">+</span> <span class="s1">&#39;/test&#39;</span><span class="p">);</span>
    <span class="nx">socket</span><span class="p">.</span><span class="nx">on</span><span class="p">(</span><span class="s1">&#39;my response&#39;</span><span class="p">,</span> <span class="kd">function</span><span class="p">(</span><span class="nx">msg</span><span class="p">)</span> <span class="p">{</span>
        <span class="nx">$</span><span class="p">(</span><span class="s1">&#39;#log&#39;</span><span class="p">).</span><span class="nx">append</span><span class="p">(</span><span class="s1">&#39;&lt;p&gt;Received: &#39;</span> <span class="o">+</span> <span class="nx">msg</span><span class="p">.</span><span class="nx">data</span> <span class="o">+</span> <span class="s1">&#39;&lt;/p&gt;&#39;</span><span class="p">);</span>
    <span class="p">});</span>
    <span class="nx">$</span><span class="p">(</span><span class="s1">&#39;form#emit&#39;</span><span class="p">).</span><span class="nx">submit</span><span class="p">(</span><span class="kd">function</span><span class="p">(</span><span class="nx">event</span><span class="p">)</span> <span class="p">{</span>
        <span class="nx">socket</span><span class="p">.</span><span class="nx">emit</span><span class="p">(</span><span class="s1">&#39;my event&#39;</span><span class="p">,</span> <span class="p">{</span><span class="nx">data</span><span class="o">:</span> <span class="nx">$</span><span class="p">(</span><span class="s1">&#39;#emit_data&#39;</span><span class="p">).</span><span class="nx">val</span><span class="p">()});</span>
        <span class="k">return</span> <span class="kc">false</span><span class="p">;</span>
    <span class="p">});</span>
    <span class="nx">$</span><span class="p">(</span><span class="s1">&#39;form#broadcast&#39;</span><span class="p">).</span><span class="nx">submit</span><span class="p">(</span><span class="kd">function</span><span class="p">(</span><span class="nx">event</span><span class="p">)</span> <span class="p">{</span>
        <span class="nx">socket</span><span class="p">.</span><span class="nx">emit</span><span class="p">(</span><span class="s1">&#39;my broadcast event&#39;</span><span class="p">,</span> <span class="p">{</span><span class="nx">data</span><span class="o">:</span> <span class="nx">$</span><span class="p">(</span><span class="s1">&#39;#broadcast_data&#39;</span><span class="p">).</span><span class="nx">val</span><span class="p">()});</span>
        <span class="k">return</span> <span class="kc">false</span><span class="p">;</span>
    <span class="p">});</span>
<span class="p">});</span>
<span class="p">&lt;/</span><span class="nt">script</span><span class="p">&gt;</span>

<span class="p">&lt;/</span><span class="nt">head</span><span class="p">&gt;</span>
<span class="p">&lt;</span><span class="nt">body</span><span class="p">&gt;</span>
    <span class="p">&lt;</span><span class="nt">h1</span><span class="p">&gt;</span>Flask-SocketIO Test<span class="p">&lt;/</span><span class="nt">h1</span><span class="p">&gt;</span>
    <span class="p">&lt;</span><span class="nt">h2</span><span class="p">&gt;</span>Send:<span class="p">&lt;/</span><span class="nt">h2</span><span class="p">&gt;</span>
    <span class="p">&lt;</span><span class="nt">table</span><span class="p">&gt;</span>
        <span class="p">&lt;</span><span class="nt">tr</span><span class="p">&gt;</span>
            <span class="p">&lt;</span><span class="nt">td</span><span class="p">&gt;</span>
                <span class="p">&lt;</span><span class="nt">form</span> <span class="na">id</span><span class="o">=</span><span class="s">&quot;emit&quot;</span> <span class="na">method</span><span class="o">=</span><span class="s">&#39;POST&#39;</span> <span class="na">action</span><span class="o">=</span><span class="s">&#39;#&#39;</span><span class="p">&gt;</span>
                    <span class="p">&lt;</span><span class="nt">textarea</span> <span class="na">name</span><span class="o">=</span><span class="s">&quot;emit_data&quot;</span> <span class="na">id</span><span class="o">=</span><span class="s">&quot;emit_data&quot;</span><span class="p">&gt;&lt;/</span><span class="nt">textarea</span><span class="p">&gt;</span>
                    <span class="p">&lt;</span><span class="nt">div</span><span class="p">&gt;&lt;</span><span class="nt">input</span> <span class="na">type</span><span class="o">=</span><span class="s">&quot;submit&quot;</span> <span class="na">value</span><span class="o">=</span><span class="s">&quot;Emit&quot;</span><span class="p">&gt;&lt;/</span><span class="nt">div</span><span class="p">&gt;</span>
                <span class="p">&lt;/</span><span class="nt">form</span><span class="p">&gt;</span>
            <span class="p">&lt;/</span><span class="nt">td</span><span class="p">&gt;</span>
            <span class="p">&lt;</span><span class="nt">td</span><span class="p">&gt;</span>
                <span class="p">&lt;</span><span class="nt">form</span> <span class="na">id</span><span class="o">=</span><span class="s">&quot;broadcast&quot;</span> <span class="na">method</span><span class="o">=</span><span class="s">&#39;POST&#39;</span> <span class="na">action</span><span class="o">=</span><span class="s">&#39;#&#39;</span><span class="p">&gt;</span>
                    <span class="p">&lt;</span><span class="nt">textarea</span> <span class="na">name</span><span class="o">=</span><span class="s">&quot;broadcast_data&quot;</span> <span class="na">id</span><span class="o">=</span><span class="s">&quot;broadcast_data&quot;</span><span class="p">&gt;&lt;/</span><span class="nt">textarea</span><span class="p">&gt;</span>
                    <span class="p">&lt;</span><span class="nt">div</span><span class="p">&gt;&lt;</span><span class="nt">input</span> <span class="na">type</span><span class="o">=</span><span class="s">&quot;submit&quot;</span> <span class="na">value</span><span class="o">=</span><span class="s">&quot;Broadcast&quot;</span><span class="p">&gt;&lt;/</span><span class="nt">div</span><span class="p">&gt;</span>
                <span class="p">&lt;/</span><span class="nt">form</span><span class="p">&gt;</span>
            <span class="p">&lt;/</span><span class="nt">td</span><span class="p">&gt;</span>
        <span class="p">&lt;/</span><span class="nt">tr</span><span class="p">&gt;</span>
    <span class="p">&lt;/</span><span class="nt">table</span><span class="p">&gt;</span>
    <span class="p">&lt;</span><span class="nt">h2</span><span class="p">&gt;</span>Receive:<span class="p">&lt;/</span><span class="nt">h2</span><span class="p">&gt;</span>
    <span class="p">&lt;</span><span class="nt">div</span> <span class="na">id</span><span class="o">=</span><span class="s">&quot;log&quot;</span><span class="p">&gt;&lt;/</span><span class="nt">div</span><span class="p">&gt;</span>
<span class="p">&lt;/</span><span class="nt">body</span><span class="p">&gt;</span>
<span class="p">&lt;/</span><span class="nt">html</span><span class="p">&gt;</span>
</pre></div>

<p>
推荐在额外安装个 <code>eventlet</code> :
</p>
<pre>
pip3 install eventlet
</pre>
<p>
来支持更好的websocket并发，但在这里不是重点。首先我们看到代码，很是简洁明了，我想需要就以下细节说明以下即可:
</p>
</div>


<div class="outline-3">
<h3 id="orgheadline2">事件</h3>
<div class="outline-text-3" id="text-2-1">
<p>
遇到何种事件做何种事情，默认的内置事件有: <code>connect</code> , <code>disconnect</code> , <code>message</code> , <code>json</code> 。后面再详细讨论之。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline3">namespace</h3>
<div class="outline-text-3" id="text-2-2">
<p>
含义类似于flask蓝图的 <code>url_prefix</code> 。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline4">emit函数</h3>
<div class="outline-text-3" id="text-2-3">
<p>
具体发送某个事件和该事件下的信息。然后我们看到 <code>broadcast=True</code> ，这样本次信号发送相当于一次广播，所有打开的网页都可以接受到这个广播信号，而不加的话，只有某一个web client能够看到。
</p>

<p>
再来看到网页那边，需要加载 <code>jquery</code> 和 <code>socket.io</code> 这两个js库。
</p>
<pre>
&lt;script type="text/javascript" src="//code.jquery.com/jquery-1.4.2.min.js"&gt;&lt;/script&gt;
&lt;script type="text/javascript" src="//cdnjs.cloudflare.com/ajax/libs/socket.io/1.3.5/socket.io.min.js"&gt;&lt;/script&gt;
</pre>

<p>
然后是下面这段代码，因为我js也是个新手，读者可以和我一起慢慢看一下。
</p>
<div class="highlight"><pre><span></span><span class="o">&lt;</span><span class="nx">script</span><span class="o">&gt;</span>
<span class="nx">$</span><span class="p">(</span><span class="nb">document</span><span class="p">).</span><span class="nx">ready</span><span class="p">(</span><span class="kd">function</span><span class="p">(){</span>
    <span class="kd">var</span> <span class="nx">socket</span> <span class="o">=</span> <span class="nx">io</span><span class="p">.</span><span class="nx">connect</span><span class="p">(</span><span class="s1">&#39;http://&#39;</span> <span class="o">+</span> <span class="nb">document</span><span class="p">.</span><span class="nx">domain</span> <span class="o">+</span> <span class="s1">&#39;:&#39;</span> <span class="o">+</span> <span class="nx">location</span><span class="p">.</span><span class="nx">port</span> <span class="o">+</span> <span class="s1">&#39;/test&#39;</span><span class="p">);</span>
    <span class="nx">socket</span><span class="p">.</span><span class="nx">on</span><span class="p">(</span><span class="s1">&#39;my response&#39;</span><span class="p">,</span> <span class="kd">function</span><span class="p">(</span><span class="nx">msg</span><span class="p">)</span> <span class="p">{</span>
        <span class="nx">$</span><span class="p">(</span><span class="s1">&#39;#log&#39;</span><span class="p">).</span><span class="nx">append</span><span class="p">(</span><span class="s1">&#39;&lt;p&gt;Received: &#39;</span> <span class="o">+</span> <span class="nx">msg</span><span class="p">.</span><span class="nx">data</span> <span class="o">+</span> <span class="s1">&#39;&lt;/p&gt;&#39;</span><span class="p">);</span>
    <span class="p">});</span>
    <span class="nx">$</span><span class="p">(</span><span class="s1">&#39;form#emit&#39;</span><span class="p">).</span><span class="nx">submit</span><span class="p">(</span><span class="kd">function</span><span class="p">(</span><span class="nx">event</span><span class="p">)</span> <span class="p">{</span>
        <span class="nx">socket</span><span class="p">.</span><span class="nx">emit</span><span class="p">(</span><span class="s1">&#39;my event&#39;</span><span class="p">,</span> <span class="p">{</span><span class="nx">data</span><span class="o">:</span> <span class="nx">$</span><span class="p">(</span><span class="s1">&#39;#emit_data&#39;</span><span class="p">).</span><span class="nx">val</span><span class="p">()});</span>
        <span class="k">return</span> <span class="kc">false</span><span class="p">;</span>
    <span class="p">});</span>
    <span class="nx">$</span><span class="p">(</span><span class="s1">&#39;form#broadcast&#39;</span><span class="p">).</span><span class="nx">submit</span><span class="p">(</span><span class="kd">function</span><span class="p">(</span><span class="nx">event</span><span class="p">)</span> <span class="p">{</span>
        <span class="nx">socket</span><span class="p">.</span><span class="nx">emit</span><span class="p">(</span><span class="s1">&#39;my broadcast event&#39;</span><span class="p">,</span> <span class="p">{</span><span class="nx">data</span><span class="o">:</span> <span class="nx">$</span><span class="p">(</span><span class="s1">&#39;#broadcast_data&#39;</span><span class="p">).</span><span class="nx">val</span><span class="p">()});</span>
        <span class="k">return</span> <span class="kc">false</span><span class="p">;</span>
    <span class="p">});</span>
<span class="p">});</span>
<span class="o">&lt;</span><span class="err">/script&gt;</span>
</pre></div>

<p>
首先是在文档加载完之后执行这个函数，然后建立了一个socket变量，然后当接受到 <code>my response</code> 事件的时候，则执行该函数，具体就是在log那边表现在添加某个文字内容。
</p>

<p>
然后下面两个是表单的emit那个标签，也就是html代码的emit那个按钮，如果点击submit了则执行这个函数，大体是发送 <code>my event</code> 事件，后面跟着某个data。
</p>

<p>
整个过程大体就是如此，读者可以简单的事件看一下效果。
</p>
</div>
</div>
</div>
</div>
</body>
</html>
